tap "homebrew/bundle"
tap "modularml/packages"
tap "runpod/runpodctl"

brew "charmbracelet/tap/crush"
brew "codex"
brew "coreutils"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "firebase-cli"
brew "fzf"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gomi"
brew "imagemagick"
brew "jj"
brew "jjui"
brew "jq"
brew "kimi-cli"
brew "modularml/packages/modular"
brew "mole"
brew "neovim"
brew "node"
brew "openssl@1.1"
brew "perl"
brew "pnpm"
brew "poppler"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "qwen-code"
brew "ripgrep"
brew "ruby"
brew "runpod/runpodctl/runpodctl"
brew "sevenzip"
brew "opencode"
brew "swiftformat"
brew "swiftlint"
brew "tmux"
brew "typst"
brew "unbound"
brew "uv"
brew "wget"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-async"
brew "zsh-syntax-highlighting"

cask "antigravity"
cask "apptivate"
cask "athas"
cask "atom"
cask "bitwarden"
cask "cap"
cask "claude-code"
cask "codex"
cask "discord"
cask "droid"
cask "firefox"
cask "flux-app"
cask "font-hack-nerd-font"
cask "font-ibm-plex"
cask "font-fontawesome"
cask "font-guguru-sans-code-nf"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono"
cask "font-zed-sans"
cask "gcloud-cli"
cask "ghostty"
cask "iina"
cask "iterm2"
cask "loom"
cask "loop"
cask "mos"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "raycast"
cask "slack"
cask "signal"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "windsurf"
cask "zed"
cask "zen"
cask "zotero"
