tap "homebrew/bundle"
tap "modularml/packages"
tap "sst/tap"

brew "aom"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bdw-gc"
brew "cairo"
brew "ccache"
brew "cmake"
brew "codex"
brew "coreutils"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "git"
brew "glib"
brew "gnutls"
brew "gnupg"
brew "graphviz"
brew "hatch"
brew "imagemagick"
brew "jj"
brew "jq"
brew "latexindent"
brew "libgcrypt"
brew "libksba"
brew "libyaml"
brew "modularml/packages/modular"
brew "neovim"
brew "ninja"
brew "node"
brew "ollama"
brew "openssl@1.1"
brew "perl"
brew "pkgconf"
brew "poppler"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "ruby"
brew "sevenzip"
brew "sst/tap/opencode"
brew "swiftformat"
brew "swiftlint"
brew "tmux"
brew "typst"
brew "unbound"
brew "uv"
brew "wget"
brwe "yazi"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-syntax-highlighting"

cask "apptivate"
cask "atom"
cask "bitwarden"
cask "cap"
cask "discord"
cask "firefox"
cask "flux-app"
cask "font-hack-nerd-font"
cask "font-ibm-plex"
cask "font-fontawesome"
cask "font-roboto"
cask "font-source-sans-3"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono"
cask "font-zed-sans"
cask "ghostty"
cask "iterm2"
cask "pdf-expert"
cask "loom"
cask "loop"
cask "mos"
cask "netnewswire"
cask "obsidian"
cask "raycast"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zed"
cask "zotero"

vscode "akamud.vscode-theme-onedark"
vscode "github.github-vscode-theme"
vscode "julialang.language-julia"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "nvarner.typst-lsp"
