tap "homebrew/bundle"

brew "aom"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bdw-gc"
brew "glib"
brew "cairo"
brew "ccache"
brew "cmake"
brew "coreutils"
brew "curl"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "libgcrypt"
brew "libksba"
brew "gnupg"
brew "graphviz"
brew "perl"
brew "latexindent"
brew "libyaml"
brew "ninja"
brew "openssl@1.1"
brew "pkg-config"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "ruby"
brew "tmux"
brew "typst"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "zsh"

cask "apptivate"
cask "atom"
cask "discord"
cask "firefox"
cask "flux"
cask "font-hack-nerd-font"
cask "font-ibm-plex"
cask "font-zed-mono"
cask "font-zed-sans"
cask "iterm2"
cask "pdf-expert"
cask "slack"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zed"

vscode "akamud.vscode-theme-onedark"
vscode "github.github-vscode-theme"
vscode "julialang.language-julia"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "nvarner.typst-lsp"
